# https://github.com/Homebrew/homebrew-bundle
brew "chezmoi"
brew "fd"
brew "gnupg"
brew "helix"
brew "mcfly"
brew "nmap"
brew "ollama"
brew "pinentry-mac"
brew "ripgrep"
brew "sccache"
brew "starship"
brew "typst"
brew "uv"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

cask "alt-tab"
cask "bettertouchtool"
cask "bitwarden"
cask "claude"
cask "firefox"
cask "font-fira-code"
cask "julia-app"
cask "keepassxc"
cask "obsidian"
cask "rectangle-pro"
cask "sublime-text"
cask "zed"
