charliermarsh.ruff
ckolkman.vscode-postgres
davidanson.vscode-markdownlint
docker.docker
github.copilot
github.copilot-chat
github.vscode-github-actions
mathematic.vscode-latex
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
redhat.vscode-yaml
rust-lang.rust-analyzer
tamasfe.even-better-toml
yzane.markdown-pdf
